[Oreans]

&New = &Nouveau
&Open... = &Ouvrir...
&Save = &Enregistrer
Save &As... = &Enregistrer comme...
&Protect = &Protéger
&Help = &Aide
About... = À propos de…
Demo Version = Version de démonstration
Save = Enregistrer

Options = Options
Application Information = Information application
Protection Options = Options de protection
Code Replace = CodeReplace
Virtual Machine = Machine virtuelle
Customized Dialogs = Dialogues personnalisés
Advanced Options = Options avancées
XBundler = XBundler
Help = Aide
Registration = Référencement
Trial Settings = Réglage version de test
Hardware Lock = Verrouillage hardware
Password Protection = Protection par mot de passe
Soft&ware = Logiciel
&Customers = &Clients
&License Manager = &Gestion de la licence
&Managers = &Managers
&Project = &Projet
Tools = Outils
H&elp = Aide
&Contents = &Contenus
&About = &À propos de
Export Generators = Générateur de fichiers d'export
&Software = &Logiciel
&License = &Licence
Password = Mot de passe
Trial Extension = Prolongement de la période de test
&Exit = &Sortir
P&rotect = Protéger
Open Project = Ouvrir un projet
New Project = Projet nouveau
Save Project = Enregistrer le projet
Save Project As... = Enregistrer le projet comme...
Protect File = Protéger le fichier
Dupli&cate = Doubler
(Double click to select) = (Double-clic pour sélecter)


Application = Application
Version = Version
Input Filename = Nom d'entrée
Output Filename = Nom de sortie
File Size = Dimension du fichier
File Information = Information fichier
Get from version info = Obtenir information du fichier
File not found = Impossible de trouver le fichier
Refresh = Actualiser
Same as input = Le même que le fichier d’entrée

Advanced Anti-Debugger = Anti-débogueur  avancé
Enable Protection = Activer la protection
Advanced API-Wrapping = API-Wrapping avancé
Anti Dumpers = Anti-vidage
Entry Point Obfuscation = Obscurcissement du point d’entrée
Anti-Patching = Anti-Patching
None = Aucun
File Patching = Patching du fichier
Compression = Compression
Resources = Ressources
Monitor Blockers = Bloqueurs de moniteur
Files Monitors = Moniteurs de fichiers
Registry Monitors = Moniteurs de la base de registre
Delphi/BCB Form Protection = Protection de formulaires Delphi/BCB 
Memory Guard = Protection de mémoire
Resources Encryption = Chiffrement des ressources
VMWare/Virtual PC = VMWare/Virtual PC
Compatible = Compatible
When Debugger Found = Lorsqu’on trouve le débogueur 
Enable Encryption = Activer chiffrement
Display Message = Afficher message
Exit Silently = Sortie silencieuse
Crash Application = En cas de plantage
Metamorph Security = Sécurité métamorphique
Ring-0 Protection = Protection Ring-0
(not available in DEMO) = (Indisponible en version de test)

Import = Importer
Export = Exporter
Reset Messages = Réinitialisation messages

Global Caption = Titre global
Debugger found = Débogueur  trouvé
Monitor software found = Programme moniteur trouvé
Cracking tool found = Outil de crac trouvé
File corrupted = Fichier altéré
(Not displayed in this version) = (Pas affiché en cette version)
Internal exception occured = Une exception interne a eu lieu
Virtual Machine Detected = Machine Virtuelle détectée


Enable CodeReplace Technology =Activer la technologie CodeReplace
Functions to remove using the CodeReplace Technology: = Fonctions à éliminer utilisant la technologie CodeReplace:
Assembly code inside function: = Code assemblage à l’intérieur de la fonction:
Force simulation before protection = Forcer simulation avant la protection
Run with parameters = Exécuter avec les paramètres
Start Simulation = Commencer simulation

Virtual API-Wrapper = API-Wrapper virtuel
Imported DLLs: = DLLs importés:
Functions to Virtualize: = Fonctions à virtualiser:
API Virtualization Level: = Niveau de virtualisation API:
Processor Specifications = Spécifications du processeur
Processor Type: = Type du processeur:
Multiprocessor: = Multiprocesseur:
Opcode Type: = Type de code-opération:
Dynamic Opcode: = Code-opération dynamique:
VM Complexity: = Complexité VM:
VM size (aprox): = Dimension VM (aprox):
Execution Speed: = Vitesse d’exécution:
Entry Point Virtualization = Virtualisation point d’entrée
Multi Branch Technology = Technologie Multy Branch

Mutable CISC processor = Processeur mutationnel CISC
Mutable RISC-64 processor = Processeur mutationnel RISC-64
Mutable RISC-128 processor = Processeur mutationnel RISC-128
Mutable CISC-2 processor = Processeur mutationnel CISC-2

Static opcodes = Code-opération statique
Metamorphic - Level 1 = Métamorphique - Niveau 1
Metamorphic - Level 2 = Métamorphique - Niveau 2
Metamorphic - Level 3 = Métamorphique - Niveau 3

Disabled = Désactivé
20% Dynamic = 20% dynamique
40% Dynamic = 40% dynamique 
60% Dynamic = 60% dynamique 
80% Dynamic = 80% dynamique 

Enable XBundler = Activer XBundler
Make files visible to OpenDialog = Rendre les fichiers visibles pour OpenDialog
Allow bundling from any directory = Permettre compilation de tous les annuaires
AVI files support = Support fichiers AVI
Deleted extracted on exit = Fichiers extraits éliminés à la sortie
Files to bundle: (drag files here) = Fichiers à compiler: (amener les fichiers ici)
XBundler Options = Options XBundler
Add File = Ajouter fichier
Delete File = Eliminer fichier

Filename = Nom du fichier
Write to disk? = Ecrire sur disque?
Extraction Path (if written to disk) = Chemin d’extraction (si trouvé sur disque)


Encrypt Application = Chiffrer application
Protect as DLL Plugin = Protéger comme Plugin DLL
Protect DLL plugin = Protéger DLL Plugin
Last Section Name = Nom de la dernière section
.NET assemblies = .NET assemblies
Active Context = Active Context
Enable support = Activer support
Splash screen settings = Réglages écran d’éclaboussure
Mouse Click to proceed = Clic pour continuer
Display during a number of seconds = Afficher pendant un certain nombre de secondes

This option will encrypt your protected application. You should never uncheck this option, only for debug purposes. = Cette option va chiffrer votre application protégée. Vous ne devez jamais désactiver cette option, sinon pour déboguer.

Check this option only if your protected DLL will be used as plugin in third party software. = Activez cette option seulement si votre DLL protégé est utilisé comme plugin dans un logiciel d’un tiers.

You can change the name of the last section added by Themida = Vous pouvez changer le nom de la dernière section ajoutée par Themida

This option should always be enabled to protect your .NET assemblies = Cette option doit être toujours active pour protéger vos .NET assemblies 

Support for Active Context based DLLs =  Support pour DLLs basés sur Active Context 

Select a BMP-8 image that will be displayed when your application is launched = Choisissez une image BMP-8 qui sera affichée à l’exécution de votre application

The user must click in the Splash Screen to continue running the protected application = L’utilisateur doit cliquer l’écran d'éclaboussure pour continuer l’application protégée

The splash screen will be displayed for a custom number of seconds before continue running the protected application = L’écran d’éclaboussure sera affiché pour un nombre de secondes prédéfini avant continuer l’application protégée

This option will enable Trial and Licensing protections in Ring-0, which will enhance the way that trial information is stored in the system. If you check this option, a device driver will be embedded and extracted automatically when your application runs. Notice that the Hardware ID is different if you enable or disable this option. = Cette option va activer les protections Version de Test et Licences en Ring-0, qui va optimiser la façon dont votre information sur la version de test sera  stockée dans votre ordinateur. Si vous activez cette option, un pilote sera inclut et auto extrait à l’exécution de votre application. Remarquez que le ID du Hardware est différent si vous activez ou désactivez cette option.


Reading SDK Macros = Lire SDK macro-instruction
Redirecting and Encrypting SDK Macros = En cours de rediriger et chiffrer les macro-instructions SDK
Merging sections / Preparing PE Header = Joindre section/ Préparer PE en-tête 
Examining and Wrapping API Calls = En cours d’examiner et envelopper les appels API
Generating Unique SecureEngine Code = Générer un code SecureEngine unique
Linking SecureEngine Code with Application = En cours de relationner le code SecureEngine avec l’application
Generating Unique Virtual Machine = En cours de générer Machine Virtuelle unique
Compressing Virtual Machine = En cours de compresser la Machine Virtuelle
Virtualizing VM / CodeReplace Macros = En cours de virtualiser VM/Macro-instructions CodeReplace
Compressing Application and Resources = En cours de compresser l’application et les ressources
Encrypting Application and Resources = En cour de chiffrer l’application et les ressources

Test Protected File = Tester fichiers protégés
Protect = Protéger
Cancel = Annuler
Play sound when protection finishes = Jouer son à la fin de l’opération de protéger les fichiers

This option supervises at any time if your application is running under any kind of debugger. = Cette option surveille tout le temps si votre application fonctionne a l’aide d’un débogueur 
This option avoids your application from being dumped from memory to disk even using the most advanced memory dumping tools = Cette option ne permet pas que votre application soit transférée de la mémoire sur le disque, même si on utilise un outil de vidage de mémoire très avancé
This option removes and encrypts the entry point of your application, executing it from a secure place in memory = Cette option élimine et chiffre le point d’entrée de votre application, en l’exécutant d’un secteur sûr de la mémoire
This option will keep your application resources fully encrypted against modifications = Cette option gardera les ressources de votre application hors de toute modification en les chiffrant
If you want that your application will run inside VMWare/VirtualPC you must check this option = Si vous voulez que votre application soit exécutée à l’aide de  VMWare/VirtualPC, vous devez activer cette option
This option will wrap the APIs used in your application to avoid a possible reconstruction of your original application = Cette option va envelopper les APIs utilisés dans votre application pour éviter une possible reconstruction de votre application originale
This option detects if any modification is done to your protected application, either by a cracker or a virus = Cette option détecte si votre application protégée a été modifiée par un pirate informatique ou par un virus
This option will activate the internal Metamorph engine to generate multiples opcode mutations for a single block of code = Cette option va activer l’engin 
Metamorph pour générer des multiples mutations du code-opération pour un seul bloc de code
This option will protect your application against memory patching = Cette option va protéger votre application contre les patchings de mémoire
This option allows you to choose the desired option to perform when a debugger or cracking tool has been found in memory = Cette option vous permet de choisir quoi exécuter lorsqu’un débogueur  ou un outil de piratage a été trouvé dans la mémoire
This option keeps your application code compressed meanwhile it is not executed = Cette option garde le code de l’application compressé autant qu’il n’est pas exécuté
This option keeps the resources in your application fully compressed = Cette option garde les ressources de votre application compressés
This option will compress the SecureEngine code that is appended into your protected application = Cette option va comprimer le code de SecureEngine qui est ajouté à votre application protégée
This option will detect/fool possible files monitors when your protected application is running = Cette option va détecter/frauder un possible moniteur de fichiers pendant l’exécution de votre application
This option will detect/fool possible registry monitors when your protected application is running = Cette option va détecter/frauder un possible moniteur de base de registre pendant l’exécution de votre application 
This option will protect your Delphi/BCB forms against reconstruction from memory. Note that this option is incompatible with some Delphi/BCB applications = Cette option va protéger vos formulaires Delphi/BCB contre leur reconstruction de la mémoire. Notez que cette option est incompatible avec quelques applications Delphi/BCB 
Load your customized messages from a file = Chargez votre message personnalisé d’un fichier
Save your customized messages to a file = Enregistrez votre message personnalisé dans un fichier
This list displays all the DLLs imported by your application = Cette liste affiche tous les DLLs importés par votre application
This list displays all the imported functions for the selected DLL. You can select which functions will be "virtualized" = Cette liste affiche toutes les fonctions importées pour le DLL choisi. Vous pouvez sélecter quelles fonctions seront „virtualisées”
You can import API names from a text file. The imported APIs will be virtualized in the current project = Vous pouvez importez les noms d’APIs d’un fichier texte. Les APIs importés seront virtualisés dans le projet courant
Select the maximun number of instructions to virtualize from your application entry point = Sélectez le maximum d’instructions qui seront virtualisés du point d’entrée de votre application
This option will insert multiple conditional branch instructions inside your unique Virtual Machine, making it harder to analyze = Cette option va insérer des instructions conditionnelles avec des branches multiples dans votre Machine Virtuelle unique, en le rendant plus difficile à analyser
You can save the current selected APIs into a text file to be imported by another project = Vous pouvez enregistrer les APIs sélectés dans un fichier texte pour être importés par un autre projet
Complexity level to emulate each wrapped API = Niveau de complexité pour virtualiser chaque API enveloppé

Changes have been made. Do you want to save project? = Les modifications ont été réalisées. Voulez-vous les enregistrer?
Save Changes = Enregistrer les modification

*UNSAVED* = *PAS ENREGISTRÉ*
Invalid Project File. Please, recreate a new one = Fichier projet invalide. Créez un autre, s’il vous plaît
Load Project = Charger projet
You need XBundler .NET for your .NET application. Please contact info@oreans.com = Vous avez besoin de Xbundler .NET pour votre application. Contactez info@oreans.com, s’il vous plaît
Sorry, Themida Standard cannot protect .NET files. You need to upgrade to Themida Professional for .NET support. Upgrade now? = Désolé, Themida Standard ne peut pas protéger les fichiers .NET. Vous devez prendre Themida Professional pour support .NET. Voulez-vous mettre à niveau maintenant? 
Save Project = Enregistrer projet
Save Project As... = Enregistrer projet comme...
No file selected. Please select a file to protect (Input Filename) =  Aucun fichier sélecté. Sélectez un fichier pour protéger (introduisez le nom du fichier)
No Output file selected. Please select an Output file before protecting = Aucun fichier de sortie sélecté. Sélectez, s’il vous plaît, un fichier de sortie avant de protéger
File does not exists: = Le fichier n’existe pas:  
File is already protected/compressed: = Le fichier est déjà protégé/compressé:
File has invalid macros insertion: = Le fichier contient des insertions macro invalides:
Please, review your macros again = Revoyez, s’il vous plaît vos macros
File cannot be accessed for protection: = Le fichier ne peut pas être accédé pour protéger:
Please select a new file to protect (Input Filename) = Sélectez un nouveau fichier à protéger (introduisez le nom du fichier)
File has not being simulated. Please simulate the file before protection or uncheck the "Force simulation before protecting" checkbox = Le fichier n’a pas été simulé. Simulez le fichier avant de le protéger ou désactivez l’option „Forcer simulation avant protection” 
Open Input File = Ouvrir le fichier d’entrée
The resources section in your application is empty. Themida needs to rebuild your application header. Proceed? = La section de ressources de votre application est vide. Themida doit reconstruire l’en-tête de l’application. Commencer?
Rebuild Header = Reconstruire l’en-tête 
File is compressed or already protected: = Le fichier est compressé ou déjà protégé:
Your application seems to be in use or running in memory. Please, make sure to close it before proceeding = Votre application paraît déjà fonctionner ou d’être en cours d’exécution dans la mémoire. S’il vous plaît, fermer-la avant de commencer
Error = Erreur
Your application header is incompatible with Themida. Do you want Themida to rebuild your application header? = L’en-tête de votre application est incompatible avec Themida. Voulez-vous que Themida reconstruise l’en-tête de votre application?
.NET limitation = Limitation .NET
Sorry, you cannot change the global message caption in demo version = Désolé, vous ne pouvez pas changer le message de titre global en version de test
Warning! The current CodeReplace macros are not valid for the selected file. CodeReplace macros removed = Attention! Les macro-instructions CodeReplace courantes ne sont pas valides pour le fichier sélecté. Macro-instructions CodeReplace éliminées
Warning = Attention
Warning! The current application is already protected/compressed. Do you still want to protect it? = Attention! L’application courante est déjà protégée/compressée. Voulez-vous encore la protéger?
File has a missing macro START or END: = Le fichier manque une macro-instruction START ou END:
Please review your macros again = Revoyez s’il vous plaît, vos macro-instructions
File cannot be opened: = Impossible d’ouvrir le fichier: 
Make sure that other application is not using it = Assurez-vous qu’il n’y a pas une autre application qui l’utilise
File to protect has an invalid PE header. Unable to inspect file = Le fichier à protéger n’as pas un en-tête PE valide. Impossible d’inspecter le fichier
File to protect contains one macro with few lines of code on it. Please review your macros again = Le fichier à protéger contient une macro-instruction avec seulement quelques lignes de code. Revoyez vos macro-instructions, s’il vous plaît 
Sorry, the current version of Themida does not support CodeReplace in Visual Basic Pcode applications = Désolé, la version courante de Themida ne supporte pas CodeReplace dans des applications VisualBasic Pcode
Sorry, the current version of Themida does not support CodeReplace in .NET applications = Désolé, la version courante de Themida ne supporte pas CodeReplace dans des applications .NET
Unable to find a function to add CodeReplace technology = Impossible de trouver une fonction pour ajouter la technologie CodeReplace
Run with parameters = Exécuter avec des paramètres
Please enter the parameters = Introduisez les paramètres
Sorry, you cant disable that option in demo version = Désolé, vous ne pouvez pas désactiver cette option en version de test
Messages exported to = Messages exportés à
Messages imported from = Messages importés de
Themida GUI Overview = Sommaire GUI de Themida 
Protect Now = Protéger maintenant
SecureEngine Technology = La technologie SecureEngine
SecureEngine Macros = Macro-instructions SecureEngine
Code Replace = CodeReplace
Software Updates = Mises au niveau du logiciel
What is XBundler = Qu’est-ce que Xbundler?
Using XBundler = Comment utiliser XBundler

Scenarios for Using XBundler = Scénarios pour utiliser XBundler
*** ERROR: Project file does not exist or invalid. (Exit code 1) *** = *** ERREUR: Fichier projet n’existe pas ou invalide. (Code sortie 1) ***
*** ERROR: File to protect does not exist. (Exit code 2) *** = ERREUR: Fichier à protéger n’existe pas. (Code sortie 2) ***
*** ERROR: File is already protected. (Exit code 3) *** = ERREUR: Fichier déjà protégé. (Code sortie 3) ***
*** ERROR: Error in SecureEngine macros. Please review them again. (Exit code 4) *** = ERREUR: Erreur dans les macro-instructions SecureEngine. Revoyez-les s’il vous plaît(Code sortie 4) ***
*** ERROR: File to protect cannot be opened. (Exit code 2) *** = ERREUR: Fichier à protéger ne peut pas être ouvert. (Code sortie 2) ***
*** ERROR: The splash file seems do not have 256 colors. Only 256 BMP files will be displayed correctly. = ERREUR: Le fichier d’écran d’éclaboussure n’a pas 256 couleurs. Seulement les fichiers 256 BMP seront affichés correctement.
*** ERROR: The splash file seems to be a BMP compressed. Only non compressed BMP files will be displayed correctly. = ERREUR: Le fichier d’écran d’éclaboussure paraît être un BMP compressé. Seulement les fichiers BMP non compressés seront affichés correctement.
Macros found: = Macro-instructions trouvées:
*** Fatal error while protecting file. (Exit Code 5) *** = *** Erreur fatale pendant la protection du fichier. (Code sortie 5) ***
*** ERROR: Cannot write protected file. Make sure the file is not in use. (Exit code 6) *** = *** ERREUR: Impossible d’écrire le fichier protégé. Assurez-vous que le fichier n’est pas utilisé à ce moment. (Code sortie 6) ***
Generating Unique SecureEngine Code... = En cours de générer un code unique SecureEngine... 
Linking SecureEngine Code with Application... = En cours de relationner le code SecureEngine avec l’application
done. = terminé.
Encrypting Application and Resources... = En cours de chiffrer l’application et les ressources...
Compressing Application and Resources... = En cours de compresser l’application et les ressources...
Macros processed: = Macro-instructions traités:

processed: = traité:
Application successfully protected. = L’application à été protégée.
Do you want to go to the order form Themida subscription plans? = Voulez-vous aller au formulaire pour la subscription à Themida?
No file selected. Please, select a file to protect (Input Filename) = Aucun fichier sélecté. Choisissez un fichier à protéger (introduisez le nom du fichier)
Question = Question
-- Files to Bundle -- = --Fichiers à joindre --
The path of the file that you are inserting must be relative to: = Le chemin du fichier que vous insérez doit être relative à:
All imported by ordinal! = Tout importé par ordinal!
Medium = Moyen
Normal = Normal
High = Haut
Supreme = Suprême
Extreme = Extrême
Highest = Le plus haut

This option is not enabled in DEMO version = Cette option n’est pas activée en version de test
DEMO Restriction = Restriction version de test
The splash file seems do not have 256 colors. Only 256 BMP files will be displayed correctly. = L’écran d’éclaboussure n’a pas 256 couleurs. Seulement les fichiers 256 BMP seront affichés correctement.
The splash file seems to be a BMP compressed. Only non compressed BMP files will be displayed correctly. = Le fichier d’écran d’éclaboussure paraît être un BMP compressé. Seulement les fichiers BMP non compressés seront affichés correctement.
Sorry, Themida DEMO does not support RISC-128 processors = Désolé, Themida version de teste ne supporte pas les processeurs RISC-128
Processor Type = Type du processeur
Sorry, Themida DEMO does not support Dynamic Opcodes = Désolé, Themida version de test ne supporte pas des codes opération dynamiques
The file is never extracted to disk! = Le fichier n’est jamais extrait sur le disque!
Select file/s to bundle = Sélectez le/s fichier/s à joindre
No file selected. Please, select a file to protect (Input Filename) = Aucun fichier sélecté. Choisissez un fichier à protéger (introduisez le nom du fichier)
Last Modified: = Modifié la dernière fois: 
(Application header has been rebuilt by Themida) = (l’en-tête de l’application modifié par Themida)
File Type: Windows Standard Executable = Type du fichier: Windows Standard Executable
File Type: Visual Basic Native Executable = Type du fichier: Visual Basic Native Executable 
File Type: Visual Basic PCode Executable = Type du fichier: Visual Basic PCode Executable 
File Type: Windows .NET Executable = Type du fichier: Windows .NET Executable 
File Type: MACROMEDIA Executable = Type du fichier: MACROMEDIA Executable 
File Type: PowerBuilder Application = Type du fichier: PowerBuilder Application 
File Type: Excelsior JET Application = Type du fichier: Excelsior JET Application 
File Type: Dynamic Link Library (DLL) = Type du fichier: Dynamic Link Library (DLL) 
File Type: OLE Control Extension (OCX) File = Type du fichier: OLE Control Extension (OCX) File 
File Type: Screensaver File = Type du fichier: Screensaver File 
File Type: Windows NT Service = Type du fichier: Windows NT Service 
File Type: Borland Library = Type du fichier: Borland Library 
File Type: Linux Executable (ELF/i386) = Type du fichier: Linux Executable (ELF/i386) 
File Type: NT Device Driver = Type du fichier: NT Device Driver 

*** Protected with Code Virtualizer *** = *** Protégé avec Code Virtualiser***
Virtual Machine Macro Functions: = Fonctions macro de la Machine Virtuelle
CodeReplace Macro Functions: = Fonctions macro-instruction CodeReplace
CodeEncrypt Macro Functions: = Fonctions macro-instruction CodeEncrypt
ClearCode Macro Functions: = Fonctions macro-instruction Clear-Code
Registered Macro Functions: = Fonctions macro-instruction enregistrées
Unregistered Macro Functions: = Fonctions macro-instruction non enregistrées
Read functions automatically = Lire les fonctions de façon automatique
Read functions from SDK = Lire les fonctions de SDK
File already protected/compressed. = Fichier déjà protégé/compressé
Error: There is a missing START or END in one of your macros. = Erreur: Il n’y a pas un instruction START ou END dans une de vos macro-instructions.
Error: Unable to open the selected file. File may be in use. = Erreur: Impossible d’ouvrir le fichier sélecté. Le fichier peut être utilisé à ce moment.
Error: Invalid PE header in selected file. = Erreur: En-tête PE invalide dans le fichier sélecté. 
Error: The included code inside a macro is too small. = Erreur: Le code inclut dans la macro-instruction a peu de lignes.  
Error: There are at least a nested VM macros. VM macros cannot be nested. = Erreur: Il y a au moins une macro-instruction VM imbriquée. Les macro-instructions VM ne peuvent pas être imbriquées. 
Error: The selected file is not an x64 application. You need Themida x32 to protect that application. = Erreur: Le fichier sélecté n’est pas une application x64. Vous avez besoin de Themida x32 pour protéger cette application-là.
Error: The selected file is an x64 application. You need Themida x64 Edition to protect that application. = Erreur: Le fichier sélecté est une application x64. Vous avez besoin de Themida x64 Edition pour protéger cette application-là. 
Project: = Projet:
Select functions from MAP file = Sélectez des fonctions d’un fichier MAP
Read functions automatically = Lire les fonctions de façon automatique
How many functions do you want to add? = Combien de fonctions voulez-vous ajouter?
OK = OK
Sorry, the required MAP file was not found. Please, generate a MAP file for your application = Désolé, le fichier MAP requis n’a pas été trouvé. Générez, s’il vous plaît, un fichier MAP pour votre application
There are no functions to simulate. Please, insert some functions either manually or automatically = Il n’y a aucune fonction à simuler. Insérez, s’il vous plaît, quelques fonctions à la main ou de façon automatique
Simulator = Simulateur
Information = Information
None = Aucun
Message = Message
Customize Dialog = Personnaliser le dialogue
Close = Fermer

Internal Protection Messages = Messages de protection interne 
Trial/Registration Messages = Messages version de test/enregistrement
Will be displayed by WinLicense = Sera affiché par WinLicense
Displayed by SDK or not displayed = Affiché par SDK ou pas affiché
Cannot update oreans.sys driver (admin rights) = Impossible de mettre au niveau le pilote oreans.sys (droits d’admin)
Cannot open oreans.vxd driver (already in use) = Impossible d’ouvrir le pilote oreans.vxd (déjà en usage)
Driver cannot be updated = Le pilote ne peut pas être mis au niveau
Computer needs to be reset to install driver = L’ordinateur doit être réinitialisé pour installer le pilote
Cannot write oreans.vxd (already in use) = Impossible d’écrire oreans.vxd (déjà en usage)

Trial nag screen (reminder) = Écran de rappel version de test (reminder)
Trial days expired = Les jours de test ont expiré
Trial executions expired = Nombre d’exécutions de test expirés
Trial date expired = La date de version de test a expiré
Trial runtime expired = Période de fonctionnement de test expirée
Trial global time expired = Le temps total de test s’est écoulé
Trial locked to different country = Version de test limitée à un autre pays
Trial extension key corrupted = La clé pour le prolongement de la version de test est altérée
No more trial extensions allowed = Aucun prolongement permis
Show registration info (only first time when registered) = Montrer l’information d’enregistrement (seulement le premier enregistrement)
License days expired = Les jours de licence ont expiré
License executions expired = Nombre d’exécutions pendant la licence expirées 
License date expired = La date de licence a expiré
License global time expired = Le temps total de la licence a expiré
License key corrupted = La clé de licence est altérée
License locked to different machine = La licence est limitée à une autre machine
License without machine locking = Licence sans limitation à une autre machine
No more hardware changes allowed = Aucune modification du hardware permise
Stolen license key = Clé de licence piratée
License is not expirable = La licence ne peut pas expirer
License required to run = Licence requise pour fonctionner
Trial/Licensing Manager manipulated = Le trial/licencing Manager a été manipulé
Invalid user/password (for password dialog) = Utilisateur/Mot de passe invalide (pour le dialogue d’authentification)

This application(s) will run in trial/restricted mode, until registered. = Cette application fonctionnera en version de test/limitée, jusqu’à l’enregistrement
Days Expiration = Jours jusqu’à l’expiration
Date Expiration = Date de l’expiration
Executions = Exécutions 
Run Time (execution) = Temps de fonctionnement (exécution)
Global Time = Temps total
days = jours
times = fois 
minutes = minutes
Unlimited = Sans limite
(For custom restrictions) = (Pour les restrictions personnalisées) 
Trial Restrictions = Limitations version de test
Clock Change = Fréaquance de la montre
Trial Extension = Prolongement de la version test
Lock trial to user language = Limiter la version de test à la langue de l’utilisateur
Allow trial period to be extended (with a valid key) = Permettre le prolongement de la période de test (avec une clé valide)
Extension Key distribution options = Options de distribution de la clé de prolongement
With single file = Avec un seul fichier 
With Registry = Avec une base de registre
Value Name = Nom valeur
Maximum Extensions = Nombre maximum de prolongements 
Maximum extensions allowed = Nombre maximum de prolongements permis

This option sets a trial period to a certain amount of days since the application is started for the first time = Cette option établit une période de test de quelques jours dès que l’application est exécutée pour la première fois
This option sets an exact date for the end of the trial period = Cette option établit une date exacte pour la fin de la période de test
This option sets an exact number of executions allowed for an application = Cette option établit un nobre exact d’exécutions permis pour l’application
This option sets an exact amount of time (in minutes) that an application can stay in memory = Cette option établit une période exacte de temps (en minutes)pendant laquelle l’application peut rester dans la mémoire
This option sets an exact amount of total time (in minutes) that an application can run during all Windows® sessions = Cette option établit une période exacte de temps (en minutes) pendant laquelle une application peut être exécutée pendant toutes les sessions Windows®
This option allows an application to run in trial mode without any restrictions added by WinLicense = Cette option permet à une application d’être exécutée en version de test sans toute limitation de la part de WinLicense
You can select how sensitive WinLicense will behave against clock changes. If for example, you select "1 day clock back", WinLicense will ignore if the clock has been turned back for 1 day. = Vous pouvez choisir le degré de sensitivité de WinLicense face aux modifications de la montre. Si, par exemple, vous choisissez „un jour en arrière”, WinLicense va ignorer si la montre a été modifiée avec un jour en arrière. 
This option allows an application to be locked to specific country when it runs in trial mode = Cette option permet à une application d’être limitée à un certain pays en version de test
This option allows you to extend the trial period of your application with special trial extension keys = Cette option vous permet de prolonger la période de test de votre application avec des clés de version de test spéciales
This option sets the name of a trial extension file to be searched by WinLicense when the application is being started = Cette option établit que le nom d’un fichier de prolongement de version de test soit recherché par WinLicense lorsque l’application est exécutée
This option is used to allow distribution of extension keys as Windows® Registry key files = Cette option est utilisée pour permettre la distribution des clés de prolongement des versions de test comme des clés de base de registre de Windows®
This option limits the amount of trial extensions that an application can be extended = Cette option limite le nombre des prolongements de version de test d’une application

Any clock change = Tout changement d’heure
1 hour clock back = Une heure en arrière
1 day clock back = Un jour en arrière

This application(s) can be registered, with the presence of a valid key. = Cette/Ces  application/s peuvent être enregistrées par la présence d’une clé valide
License Keys Accepted = Clés de licence acceptées
Types of accepted License Keys = Types des clés de licence acceptées
Single file = Un seul fichier
Registry = Base de registre
Security Options = Options de sécurité
Enable SmartActivate® System for user-side generated keys. = Activer le SmartActivate® System pour des clés générées de côté client
Allow only hardware dependent (locked) registrations. = Permettre seulement des enrégistrements depenndantes du (limitées au) matériel
Accept only temporary keys (that expire). = Acceptez seulement les clés temporaires (qui expirent)
Application only runs when registered. (Requires a key to run) = Cette application fonctionne seulement quand est enregistrée. (Elle requiert une clé pour fonctionner)
Clear trial info when registered. = Eliminer les informations de la version de test lorsque l’application est enregistrée
License Key Signature = Signature de la clé de licence
Level 1 = Niveau 1
Level 2 = Niveau 2
For professional and elegant licensing control, WinLicense offers the SmartActivate® System. This technology allows an application to be registered using SmartActivate® keys = Pour un contrôle élégant et professionnel de la licence, WinLicense vous offre le SmartActivate® System. Cette technologie permet à une application d’être enregistrée en utilisant des clés SmartActivate®
This option restricts the use of registration keys to a specific computer. As each computer has an unique machine ID (processor type, hard disk and BIOS serial), WinLicense can lock a registration key to that specific machine = Cette option limite l’usage des clés d’enregistrement à un certain ordinateur. Dès que chaque ordinateur a un ID unique (type du processeur, les numéros matricules du BIOS et du disque dur), WinLicense peut limiter une clé d’enregistrement à cette machine-là
This option denies the use of "time unlimited" registration keys and forces WinLicense to accept only temporary registration keys = Cette option ne permet pas l’usage des clés d’enregistrement permanentes et force WinLicense à accepter seulement des clés d’enregistrement temporaires
This option allows user to run an application only in the presence of a valid registration key. WinLicense will terminate the application if no key is found or if it is invalid = Cette option permet à l’utilisateur d’exécuter l’application seulement dans la présence d’une clé d’enregistrement valide. WinLicense va terminer l’application si aucune clé est trouvée ou si elle est invalide
The purpose of this option is to clear the trial information from a computer once an user receives a valid registration key and registers an application. If the user decides to remove the registration key or it expires, the trial period will restart from zero = Le but de cette option est d’éliminer l’information de la version de test d’un ordinateur une fois que l’utilisateur reçoit une clé d’enregistrement valide et enregistre une application. Si l’utilisateur décide d’éliminer la clé d’enregistrement ou si elle expire, la période de test va réinitialiser
This option allows you to select the signature level used by WinLicense to check that licenses for your applications are genuine = Cette option vous permet de choisir le niveau de la signature de licence utilisé par WinLicense pour vérifier si les licences utilisées par votre applications sont originales

Enable Password Protection = Activez la protection avec mot de passe
Password requirement = Demande mot de passe
Password Action = Action mot de passe
Encrypt EXE using the password hash. = Chiffrer le EXE en utilisant l’empreinte numérique du mot de passe
On Normal / Trial Version = Dans la version normale/de test
On Registered Version = Dans la version enregistrée
Never ask for a password. = Jamais demandez un mot de passe.
I will ask for a password manually. = Je vais demander un mot de passe par une commande manuelle.
Automatically, ask for a password only the first time. = Demander un mot de passe de façon automatique seulement la première fois.
Automatically, always ask for a password. = Toujours demander un mot de passe de façon automatique.

Hardware Lock = Restriction hardware
Custom Hardware Items = Personnaliser components hardware
Hardware Items = Components hardware
All hardware items = Tous les components hardware
CPU = CPU
BIOS = BIOS 
MAC Address = Adresse MAC
HDD Serial = Numéro matricule du disque dur
Allowed CPU changes = Modifications CPU permises
Allowed BIOS changes = Modifications BIOS permises 
Allowed NIC changes = Modifications NIC permises 
Splash settings = Réglages écran d’éclaboussure

Keep Trial Running = Continuer l’exécution de la version de test
Keep running = Continuer l’exécution de
Launch Application when Trial Expired = Lancer l’application quand la version de test a expiré
Launch Application = Lancer l’application 
Application Name: = Nom de l’application: 
Enable Custom Event = Activer un événement personnalisé
Export Specific Generators = Exporter certains générateurs
Event Name: = Nom de l’événement:
Export Generators = Exporter générateurs
Custom Event = Evénement personnalisé
This option will export a specific license generator when your application is being protected = Cette option va exporter un certain générateur de licence lorsque votre application est protégée
This option will run an external application when the trial period in your application has expired. = Cette option va exécuter une application externe lorsque la période de test de votre application a expiré
You can define a custom event to exclude the initialization of several protected applications at the same time. This option is also suitable when your application is launched many times per minute. =  Vous pouvez définir un événement personnalisé pour exclure l’initialisation de quelques applications protégés à la fois. Cette option est aussi convenable quand votre application est lancée plusieurs fois par minute.
Check this option if you want that your application continues running in trial mode if an invalid license key is present. =  Sélectez cette option si vous voulez que votre application soit encore exécutée en version de test même après l’introduction d’une clé invalide.
*** Demo Version *** = *** Version de test ***
Destroy Exports section = Détruire la section Exports
This option will destroy the export table of your DLL control for maximum security = Cette option va détruire le tableau d’exports de votre contrôle DLL pour le maximum de sécurité
Select specific functions from your DLL to handle each event = Sélectez des fonctions spécifiques de votre DLL pour traiter chaque événement
DLL Control file = Fichier de contrôle DLL

Export specific generators to App. folder = Exporter des générateurs spécifiques dans le dossier de l’application
Trial in debug mode (for testing purposes) = La version de test en mode débogueur  (pour des raisons de test)
Check this option if you want to create a custom license generator for your protected application. The generator will be created in a subfolder inside your application folder. = Sélectez cette option si vous voulez créer un générateur de licence personnalisé pour votre application protégée. Le générateur sera crée dans un sous-dossier de votre application.
Uncheck this option only when you are going to release your protected program. For testing purposes, leave this option checked to avoid storing unnecessary information in your system about your trial status. = Désactivez cette option seulement si vous voulez débloquer votre programme protégé. Pour de raisons de test, laissez cette option sélectée pour éviter de stocker de l’information inutile dans votre système concernant l’état des versions de test.

&Add = &Ajouter
&Edit = &Editer
&Delete = &Eliminer
Name = Nom
Company = Compagnie
Total Customers: = Numéro total de clients:
New Customer = Nouveau client
Edit Customer = Editer client
Delete Customer = Eliminer client
Customers = Clients
Extra Details = Détails supplémentaires
Add Customer = Ajouter un client
Update = Mettre au niveau
Filename = Nom du fichier
Version = Version
Total Software: = Total logiciel:
Do you want to delete this software? = Voulez-vous éliminer ce logiciel?
Confirm = Confirmez
Add Software = Ajouter logiciel
Edit Software = Editer logiciel
Delete Software = Eliminer logiciel
Duplicate Software = Doubler logiciel
(leave blank to use the same input and output filename) = (laissez libre pour utiliser le même nom pour les fichiers d’entrée et de sortie)
Input File Type = Introduisez le type du fichier
License Unique Key = Clé de licence unique
Trial Unique Key =  Clé unique de la version de test
Password Unique Key =  Clé unique du mot de passe
Windows Standard Executable (EXE) = Windows Standard Executable (EXE) 
Dynamic Link Library (DLL) = Dynamic Link Library (DLL) 
OLE Control Extension (OCX) = OLE Control Extension (OCX) 
Windows .NET Executable = Windows .NET Executable 
Windows NT/XP Service = Windows NT/XP Service 
Screensaver File (SCR) = Screensaver File (SCR) 
Copy Software = Copier logiciel
Reg Unique Key missing. Please, select one. = On a pas trouvé une clé unique de base de registre. Sélectez une, s’il vous plaît.
Software Manager = Administration logiciel
Sofware name missing. Please, select one. = Nom du logiciel manque. Sélectez un, s’il vous plaît.
Reg Unique Key is too short. Please, select a new unique key. = Clé unique de base de registre trop courte. Sélectez, s’il vous plaît, une nouvelle clé unique.
Trial Unique Key missing. Please, select one. = Clé unique de la version de test manque. Sélectez une, s’il vous plaît. 
Trial Unique Key is too short. Please, select a new unique key. = Clé unique de la version de test est trop courte. Sélectez, s’il vous plaît, une nouvelle clé unique.
Pass Unique Key missing. Please, select one. = Clé unique du mot de passe manque. Sélectez une, s’il vous plaît.
Pass Unique Key is too short. Please, select a new unique key. = Clé unique du mot de passe est trop courte. Sélectez, s’il vous plaît, une nouvelle clé unique.
The software already exists in database. Please, choose a new software name or version. = Le logiciel existe déjà dans la base de données. Choisissez, s’il vous plaît, un nouveau nom du logiciel ou une nouvelle version.
A new License Hash is going to be created. Previous generated licenses will not work if you create a new hash. Proceed? = Une nouvelle empreinte numérique de la licence sera créee. Les licences créées auparavant ne fonctionneront plus si une nouvelle empreinte numérique de licence sera créée. Continuer?
Duplicated Software = Logiciel doublé
File cannot be opened. Make sure the application is not running or being used. = Le fichier ne peut pas être ouvert. Assurez-vous que l’application n’est pas en cours d’exécution ou utilisée à ce moment.
Protection Error = Erreur de protection
Protect Error = Protéger erreur
File is compressed or already protected. = Le fichier est compressé ou déjà protégé.
File has a missing macro START or END. Please correct this error before protecting. = Le fichier manque une macro-intruction START ou END. Corrigez, s’il vous plaît, cette erreur avant de continuer à protéger.
File cannot be opened. Make sure that other application is not using it. = Le fichier ne peut pas être ouvert. Assurez-vous qu’une autre application ne l’utilise pas a ce moment.
File has an invalid PE header. Unable to protect. = Le fichier a un en-tête PE invalide. Impossible de protéger.
File contains one macro with few lines of code on it. Please review your macros before protecting. = Le fichier contient une seule macro-instruction avec quelques lignes de code. Revoyez, s’il vous plaît, vos macro-instructions avant de protéger. 
File seems to be in use. Please, close the file to proceed with protection. = Le fichier paraît être en usage. S’il vous plaît, fermez
 le fichier avant de continuer avec la protection.
The splash file does not exist. = Le fichier de l’écran d’éclaboussure n’existe pas.
Splash = Ecran d’éclaboussure
The splash file seems do not have 256 colors. Only 256 BMP files will be displayed correctly. = Le fichier de l’écran d’éclaboussure paraît de ne pas avoir 256 couleurs. Seulement les fichiers 256 BMP seront affichés correctement.
The splash file seems to be a BMP compressed. Only non compressed BMP files will be displayed correctly. = Le fichier de l’écran d’éclaboussure paraît être un BMP compressé. Seulement les fichiers BMP non compressés seront affichés correctement.
Do you want to cancel the protection process? = Voulez-vous annuler le procès de protection?
Cannot open file to protect for writing. Please, make sure that the file is not being used or running. Protection aborted. = Impossible d’ouvrir le fichier à protéger pour y écrire. Assurez-vous, s’il vous plaît que le fichier n’est pas utilisé à ce moment, ou qu’il n’est pas en cours d’exécution.
Cannot write protected file to disk. Please, make sure you have write permits and enough space in your disc. = Impossible d’écrire le fichier protégé sur le disque. Assurez-vous, s’il vous plaît que vous avez la permission d’écrire ou assez d’espace libre sur le disque. 
Sorry, the DEMO version of WinLicense only allows protection with trial/licensing in debug mode = Désolé, la version de test de WinLicense permet la protection des fichiers en version de test seulement en mode débogueur 
WinLicense DEMO = Version de test WinLicense

&Add License = &Ajouter licence
&Edit License = &Editer licence
&Delete License = &Eliminer licence
Create License Key = Créer une clé de licence
Mark as Stolen = Marquer comme piraté
Unmark Stolen = Démarquer piraté
Stolen = Piraté
Ban Hardware IDs = Interdire IDs hardware
Please make a selection... = Sélectez, s’il vous plaît...
License Details = Détails de licence
License Generation = Génération de licence 
Hardware ID = ID hardware 
Custom Data = Données personnalisées 
Key Type = Type de clé
Country Locking = Limitation pays
Store generated Licenses in folder: = Stocker les licences générées dans le dossier: 
Generate File Key = Générer une clé de fichier
Generate Registry Key = Générer une clé de base de registre
Generate Text Key = Générer une clé de texte
Generate SmartActivate Key = Générer une clé SmartActivate

Total Software: = Logiciel total:
All = Tout
Please make a selection... = Sélectez, s’il vous plaît...
Nothing selected. = Rien sélecté.
Selection: = Sélection:
Software: = Logiciel:
Do you want to mark the current key as stolen? = Voulez-vous marquer cette clé comme piratée?
Stolen Keys = Clés piratées
Do you want to unmark the current key from being stolen? = Voulez-vous démarquer cette clé comme piratée?
Do you want to delete this license? = Voulez-vous éliminer cette licence?
Warning: The generated keys will have the settings from the current project. Proceed? = Attention: Les clés générées auront les réglages du projet courant.
Generate License = Générer licence 
Cannot create directory: = Impossible de créer l’annuaire:
Please, select which type of license you want to generate = Sélectez, s’il vous plaît, le type de licence que vous voulez générer
Keys successfully generated in folder: = Les clés ont été générées avec succès dans le dossier:
Please, first select a valid application to protect = S’il vous plaît, sélectez davantage une application valide à protéger
Ban Hardware Id = Interdire ID hardware

License Restrictions = Restrictions de la licence
Customer = Client
Software = Logiciel
Save = Enregistrer
Edit License = Editer licence
Add License = Ajouter licence
Please, select a customer from database. = Sélectez, s’il vous plaît un client de la base de données.
License Manager = Administration des licences
Please, select a software from database. = Sélectes, s’il vous plaît, un logiciel de la base de données.
Please, insert a Hardware ID for verification = Insérez, s’il vous plaît un ID hardware pour vérification 


The inserted Hardware ID is valid = L’ID hardware inséré est valide
Invalid Hardware ID inserted = L’ID hardware inséré est invalide 
Another instance of WinLicense is running = Une autre instance de WinLicense est en cours d’exécution
You have enabled SmartActivate keys but you have not selected any type of License Keys accepted (Single file or Registry). Remember that you have to use WLRegSmartKeyInstallToFile or WLRegSmartKeyInstallToRegistry to finally install the SmartActivate key = Vous avez activé les clés SmartActivate, mais vous n’avez pas sélecté aucun type de clés de licence acceptés (Seulement un fichier ou une entrée dans la base de registre. N’oubliez pas que vous devez utiliser WLRegSmartKeyInstallToFile ou WLRegSmartKeyInstallToRegistry pour installer finalement la clé SmartActivate
File has not been simulated: = Le fichier n’a pas été simulé:
Please simulate the file before protection or uncheck the "Force simulation before protecting" checkbox = Simulez, s’il vous plaît le fichier avant la protection, ou désactivez l’option „Forcer la simulation avant la protection”
Warning: Your application has been set up to be registered with a valid license key, but you have not selected any way of registration. If you continue, your application will not be able to be registered. Proceed? = Attention: Votre application a été réglée pour être enregistrée avec une clé de licence valide, mais vous n’avez pas sélecté aucune modalité d’enregistrement. Si vous continuez, votre application ne pourra être enregistrée. Continuer?
Warning: Your application has been set up to be extended with trial extension key, but you have not selected any way to extend the trial period. If you continue, your application will not be able to be extended. Proceed? = Attention: Votre application a été réglée pour être prolongée avec une clé de prolongement de la version de test, mais vous n’avez sélecté aucune modalité de prolongement de la version de test. Si vous voulez continuer, votre application ne pourra être prolongée. Continuer?
Your application header is incompatible with WinLicense. Do you want WinLicense to rebuild your application header? = L’en-tête de votre application est incompatible avec WinLicense. Voulez-vous que WinLicense reconstruise l’en-tête de votre application?
Sorry, WinLicense Standard cannot protect .NET files. You need to upgrade to WinLicense Professional for .NET support. Upgrade now? = Désolé, WinLicense Standard ne peut pas protéger des fichiers .NET. Vous devez prendre WinLicense Professional pour support .NET. Mettre au niveau maintenant?
Note: CodeReplace has been added into your application = Note: CodeReplace a été inséré dans votre application
(Application header has been rebuilt by WinLicense) = (L’en-tête de l’application a été reconstruit par WinLicense)
Error: The selected file is not an x64 application. You need WinLicense x32 to protect that application. = Erreur: Le fichier sélecté n’est pas une application x64. Vous avez besoin de WinLicense x32 pour protéger cette application.
Error: The selected file is an x64 application. You need WinLicense x64 Edition to protect that application. = Erreur: Le fichier sélecté est une application x64. Vous avez besoin de WinLicense x64 Edition pour protéger cette application.
Sorry, the MAP file was not found: = Désolé, le fichier MAP n’a pas été trouvé:
Please, generate a MAP file for your application = Générez, s’il vous plaît un fichier MAP pour votre application
Sorry, the current version of WinLicense does not support CodeReplace in Visual Basic Pcode applicaitons = Désolé, la version courante de WinLicense ne supporte pas CodeReplace dans des applications VisualBasic Pcode
Sorry, the current version of WinLicense does not support CodeReplace in .NET applications = Désolé, version courante de WinLicense ne supporte pas CodeReplace dans des applications .NET
There are some functions highly executed and some not executed in simulation. Do you want to unselect those functions? = Il y a quelques fonctions exécutées plus fréquemment  et d’autres non exécutées dans la simulation. Voulez-vous désélecter ces fonctions?
There are some functions highly executed in simulation. Do you want to unselect those functions? = Il y a quelques fonctions exéctutées plus fréquemment dans la simulation. Voulez-vous désélecter ces fonctions?
There are some functions not executed in simulation. Do you want to unselect those functions? = Il y a quelques fonctions non exécutées dans la simulation. Voulez-vous désélecter ces fonctions?
Messages exported to: = Messages exportés à:
Messages imported from: = Messages importés de:
WinLicense GUI Overview = Sommaire de GUI WinLicense 
Trial Settings = Réglages version de test
Trial SDK = Version de test SDK
Registration SDK = Enregistrement SDK
Password Protection = Protection avec un mot de passe
Miscellaneous SDK = Autres SDK 
Hardware Lock = Limitation hardware
WARNING: Protected in Trial Debug Mode = ATTENTION: Protégé en version de test en mode débogueur 
Click and select here = Cliquez et sélectez ici

ERROR: None of the functions handlers where specified in DLL Control = ERREUR: Aucun des manipulateurs de fonctions a été mentionné dans le Contrôle DLL
Sorry, WinLicense DEMO does not support RISC-128 processors = Désolé, la version de test de WinLicense ne supporte pas les processeurs RISC-128
Sorry, WinLicense DEMO does not support Dynamic Opcodes = Désolé, la version de test de WinLicense ne supporte pas des codes-opération Dynamiques
Signature Level 2 is not accepted for the current Software. Please, go to the Sofware Panel and re-create a new License Hash for your software = Signature Niveau 2 n’est pas acceptée pour la version courante du logiciel. Allez, s’il vous plaît au Paneau  du logiciel et recréez une nouvelle empreinte numérique pour votre logiciel
.NET Module = Module .NET
File has a missing macro START or END. Please review your macros again: = Le fichier manque une macro-instruction START ou END. Revoyez, s’il vous plaît vos macro-instructions:
File cannot be opened. Make sure that other application is not using it: = Le fichier ne peut pas être ouvert. Assurez-vous qu’il n’y a pas une autre application qui l’utilise à ce moment:
File has an invalid PE header. Unable to inspect file: = Le fichier a un en-tête PE invalide. Impossible d’inspecter le fichier:
File contains one macro with few lines of code on it. Please review your macros again: = Le fichier contient une macro-instruction avec peu de lignes de code. Revoyez, s’il vous plaît, vos macro-instructions:
Deep file analysis in progress = Analyse détaillée en progrès
File analysis in progress = Analyse du fichier en progrès
Please wait... = Attendez, s’il vous plaît...
Analyzing CodeReplace macros = En cours d’analyser les macro-instructions CodeReplace
Are you sure you want to remove the selected Hardware ID? = Etes-vous sûr que vous voulez éliminer le ID hardware sélecté?
List of Banned  Hardware IDs: = Liste des IDs hardware interdits: 
Add = Ajouter
Remove = Eliminer
Done = Terminé
Generating License Hash = En cours de générer une empreinte numérique de licence
Generate Password = Générer mot de passe
Password Generation = Génération du mot de passe
Store generated Passwords in folder: = Stocker les mots de passe générés dans le dossier:
Total Passwords: = Mots de passe totals 
Do you want to delete the selected record? = Voulez-vous éliminer les enregistrements sélectés?
Password file generated in folder: = Fichier de mot de passe généré dans le dossier: 
Password Generator = Générateur de mot de passe
Password Manager = Administration des mots de passe
Details = Détails

Add Password = Ajouter  mot de passe 
Edit Password = Editer mot de passe
Please, select a customer to generate the password = Sélectez, s’il vous plaît, un client pour générer le mot de passe
Please, select a software to generate the password = Sélectez, s’il vous plaît, un logiciel pour générer le mot de passe 
Rolling back your actions = En cours de répéter vos actions

Generate Extension = Générer prolongement
Level = Niveau
Trial Extension Generation = Génération du prolongement de la version de test
Store generated Extensions in folder: = Stocker les prolongements générés dans le dossier:
Generate File Key = Générer une clé de fichier
Generate Registry Key = Générer une clé de base de registre 
Trial extension key/s generated in folder: = Prolongement de la version de test généré dans le dossier:
Trial Extension Generator = Générateur de prolongement de la version de test
Edit = Editer
Add Trial Extension = Ajouter prolongement version de test
Edit Trial Extension = Editer prolongement version de test
Please, select a software to generate the trial extension = Sélectez, s’il vous plaît, un logiciel pour générer un  prolongement de la version de test

Warning: Trial in Debug Mode = Attention: Version de test en mode débogueur  
Debug Mode Trial = Version de test en mode débogueur 
The application that you are going to protect will not include the SecureEngine Trial Storing Manager*. = L’application que vous allez protéger ne va pas inclure le SecureEngine Trial Storing Manager*.
The trial information will be stored under the registry key: = L’information de la version de test sera stocké sous la clé de base de registre: 
(You can access to that key to reset/test the WinLicense Trial Engine) = (Vous pouvez accéder cette clé pour réinitialiser/tester l’engin de la version de test de WinLicense)
*To enable the SecureEngine Trial Storing Manager, uncheck the option "Trial in debug mode" in the Protect screen. = *Pour activer le SecureEngine Trial Storing Manager, désactivez l’option „Version de test en mode débogueur ” dans l’écran de protection. 
Don't show this screen again = N’affichez pas cet écran de nouveau

Do you want to delete the selected client? = Voulez-vous éliminer le client sélecté?
Enter new Hardware ID to ban: = Introduisez un nouveau ID hardware pour interdire:
The entered Hardware ID does not seem to be valid (must be at least 32 chars) Please, enter a valid Hardware ID = L’ID hardware introduit ne paraît pas valide (il doit être au moins 32 caractères long). Introduisez, s’il vous plaît, un ID hardware valide

File has a missing macro START or END. Please correct this error before protecting: = Le fichier manque une macro-instruction START ou END. Corrigez, s’il vous plaît cette erreur avant de protéger:
File has an invalid PE header. Unable to protect: = Le fichier a un en-tête PE invalide. Impossible de protéger:
File contains one macro with few lines of code on it. Please review your macros before protecting: = Le fichier contient une macro-instruction avec peu de lignes de code. Revoyez, s’il vous plaît, vos macro-instructions avant de protéger:
The input file seems to be in use. Please, close the file to proceed with protection: = Le fichier d’entrée paraît être utilisé à ce moment. Fermez, s’il vous plaît, le fichier avant de protéger:

Code Virtualization = Virtualisation du code
Virtual Opcodes Obfuscation = Obscurcissement des codes opération virtuels
Current: = Courant:
Virtual Machine Complexity = Complexité de la machine virtuelle 
Size (Approx): = Dimension (Aprox):
Opcodes Mutation = Mutation des codes opération
Multiple Virtual Machines = Machines virtuelles multiples
NumVMs * SizeVM: = NumMVs * DimensionMVs: 
Fake Stack Emulation = Emulation pile fausse 
Strip Relocations (EXEs) = Eliminer translations (EXEs)
Strip relocations = Eliminer translations 
Re-Virtualization = Re-virtualisation
Multi Branch Technology = Technologie Multi Branch 
Fake Emulation = Emulation fausse
Keep original name = Garder le nom original
Functions that will be virtualized: = Fonctions à virtualiser:

You can customize how complex will be the Virtual Machine opcodes. The size of the generated opcodes depend on the complexity selected = Vous pouvez choisir la complexité de vos codes opération de la machine virtuelle. La dimension des codes opération générés est établie en fonction de la complexité sélectée.
You can customize how complex the generated virtual machine will be. The size of the virtual machine depends on the complexity that you select = Vous pouvez choisir la complexité de la machine virtuelle. La dimension de la machine virtuelle est établie en fonction de la complexité sélectée.
You can mutate the internal virtual opcodes, generating a more complex virtual machine = Vous pouvez muter les code-opération internes en générant une machine virtuelle plus complexe.
The generad Virtual Machine and virtual opcodes will be placed inside the last section of your application. You can rename the last section of your application as desired = La machine virtuelle et les codes opération virtuelles générées seront remplacées dans la dernière section de votre application. Vous pouvez renommer la dernière section de votre application à votre choix
You can create several Virtual Machines inside your protected application. Each Virtual Machine will process specific blocks of code in your application = Vous pouvez plusieurs machines virtuelles dans votre application protégée. Chaque machine virtuelle va traiter certains blocs de code dans votre application
This option will assume the stack to be initilized to zero for all not allocated entries in stack. This option should be enabled for PureBasic applications = Cette option va considérer la pile initialisée à zéro pour toutes les entrées non assignées dans la pile. Cette option doit être activée pour les applications PureBasic
You can remove the relocations section from the PE header for EXE files, reducing the size of the final protected application = Vous pouvez éliminer la section des translations de l’en-tête PE pour les fichiers EXE, en réduisant ainsi la dimension de l’application protégée finale.
Re-Virtualization is an extremely powerful technique against Reverse Engineering. But it can decrease a lot the performance in speed in the protected blocks.  Please, check the performance of your application when protected with Re-Virtualization = La re-virtualisation est une technique très puissante contre l’ingénierie inverse. Mais elle peut faire décroître la vitesse d’exécution des blocs protégés. Vérifiez, s’il vous plaît la performance de votre application lorsqu’elle est protégée avec re-virtualisation
This option will insert multiple conditional branch instructions inside your unique virtual machine, making it harder to analyse = Cette option va insérer des instructions conditionnelles avec des branches multiples dans votre machine virtuelle unique, en le rendant plus difficile à analyser

Please, select an application to protect = Sélectez, s’il vous plaît une application à protéger
The selected application does not have any functions to virtualize. Please insert functions using the SDK = L’application sélectée n’a aucune fonction à virtualiser. Insérez, s’il vous plaît des fonctions en utilisant le SDK
All functions to virtualize were disabled. Please, select at least one = Toutes les fonctions à virtualiser ont été désactivées. Sélectez, s’il vous plaît au moins une
Warning! A macro with no code inside has been found. This might be due to compiler optimizations. Please, disable your compiler optimizations or review each macro. = Attention: une macro-instruction sans code à été trouvée. Cela pourrait être le résultat des optimisations du compilateur. Désactivez, s’il vous plaît les optimisations de votre compilateur ou revoyez chaque macro-instruction.
Virtual Functions = Fonctions virtuelles
Inserted via "Call VarPtr": = Inséré via "Call VarPtr": 
Inserted via inline Assembly: = Inséré via assemblage inline
Inserted via auxiliar API: = Inséré via API auxiliaire
Inserted via MAP file: = Inséré via un fichier MAP
NO FUNCTIONS FOUND TO VIRTUALIZE!!! = AUCUNE FONCTION A VIRTUALISER!!!
(Application header has been rebuilt by Code Virtualizer) = (L’en-tête de l’application a été reconstruit par Code Virtualizer)
Protecting an Application = En cours de protéger une application
Learn About Virtualizer = Apprendre des informations sur Virtualizer
Code Virtualization = Virtualisation du code
Code Virtualize Macros = Macro-instructions Code Virtualize
**** Sorry, the DEMO version does not support protection via command line **** = **** Désolé, la version de test ne supporte pas la protection via ligne de commande ****
*** ERROR: File to protect cannot be acccessed. (Exit code 2) *** = *** ERREUR: Impossible d’accéder le fichier à protéger. (Code sortie 2) ***
*** ERROR: File does not have any blocks to protect. (Exit code 3) *** = *** ERREUR: Le fichier n’a aucun bloc de code à protéger (Code sortie 3) ***
*** ERROR: File to protect cannot be opened. (Exit code 5) *** = *** ERREUR: Impossible d’ouvrir le fichier à protéger. (Code sortie 5) ***
Generating Specific Virtual Machine = En cours de générer une machine virtuelle spécifique
Virtualizing Function = En cours de virtualiser la fonction
Re-Virtualizing ... = En cours de re-virtualisation...
Flushing file ... = En cours de vider le fichier ...
Sorry, the DEMO version only allows one Virtual Machine per application = Désolé, la version de test permet seulement une machine virtuelle per application 
Sorry, the DEMO version does not support Re-Virtualization = Désolé, la version de test ne supporte pas la re-virtualisation 
The application is already protected. You cannot protect an already protected application in the DEMO version = L’application est déjà protégée. Vous ne pouvez pas protéger une application qui est déjà protégée en version de test
The Input application cannot be accessed. Please, check that the application is not in use: = L’application d’entrée ne peut pas être accédée. Vérifiez, s’il vous plaît si l’application est en cours d’exécution:
The Output application cannot be accessed. Please, check that the application path is valid or file is not in use: = L’application de sortie ne peut pas être accédée. Vérifiez, s’il vous plaît, si l’application est un fichier valide ou si elle est en cours d’exécution:
Limitations in DEMO version: = Limitations en version de test:
Virtual Opcodes Obfuscation set to NORMAL = Obscurcissement des codes opération réglé à NORMALE
Virtual Machine Complexity set to NORMAL = Complexité de la machine virtuelle réglée à NORMALE
Only ONE macro is virtualized = Seulement une macro-instruction est virtualisée 
The Output application cannot be accessed. Please, check that the application is not in use: = L’application de sortie ne peut pas être accédée. Vérifiez, s’il vous plaît, si l’application est en cours d’exécution:
PE Information = Information PE
Input PE file: = Fichier d’entrée PE
Output PE file: = Fichier de sortie PE
Virtual Functions found: = Fonctions virtuelles trouvées:
PE file analysis... OK! = Analyse du fichier PE... OK!
Virtualization = Virtualisation
Generating Specific Virtual Machine = En cours de générer la machine virtuelle spécifique
Size: = Dimension:
Virtualizing Function = En cours de virtualiser la fonction
Start: = Début: 
Skipped = Sauté
bytes = octet
Cancelling... = En cours d’annuler...
Re-Virtualization = Re-virtualisation
Re-Virtualizing ... = En cours de re-virtualisation...
Final Stats = Statistiques finales
Virtualized Functions: = Fonctions virtualisées:
Skipped Functions: = Fonctions sautées:
Errors: = Erreurs:
Increase in size: = Augmentation de la dimension:
Application successfully protected! = Protection de l’application réussie!
Protection CANCELLED! = Protection ANNULÉE!
Do you really want to Cancel the protection process? = Voulez-vous annuler le procès de protection?
Cancel Protection = Annuler la protection
Select a Software to protect from the WinLicense database = Sélectez un logiciel à protéger de la base de données de WinLicense
??

??

??

??

14

??

??

??

??



